requests/get-snapshot.xml

<?xml version="1.0" encoding="UTF-8"?>
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <RetrieveVStorageObject xmlns='urn:vim25'>
            <_this type="VcenterVStorageObjectManager">VStorageObjectManager</_this>
            <id>
                <id>{0}</id>
            </id>
            <datastore>{1}</datastore>
        </RetrieveVStorageObject>
    </Body>
</Envelope>